// ignore: unused_import
import 'package:intl/intl.dart' as intl;
import 'app_localizations.dart';

// ignore_for_file: type=lint

/// The translations for Russian (`ru`).
class AppLocalizationsRu extends AppLocalizations {
  AppLocalizationsRu([String locale = 'ru']) : super(locale);

  @override
  String get appTitle => 'Vless VPN';

  @override
  String get connect => 'Подключить';

  @override
  String get disconnect => 'Отключить';

  @override
  String get connected => 'Подключено';

  @override
  String get disconnected => 'Отключено';

  @override
  String get connecting => 'Подключение...';

  @override
  String get selectServer => 'Выбрать сервер';

  @override
  String get clickToSelect => 'Нажмите для выбора';

  @override
  String get autoSelectBest => 'Авто выбор (лучший)';

  @override
  String get optimized => 'Оптимизировано';

  @override
  String get manualSelection => 'Выбрано вручную';

  @override
  String get unknown => 'Неизвестно';

  @override
  String get securelyConnected => 'БЕЗОПАСНО ПОДКЛЮЧЕНО';

  @override
  String get connectingUpper => 'ПОДКЛЮЧЕНИЕ...';

  @override
  String get disconnectingUpper => 'ОТКЛЮЧЕНИЕ...';

  @override
  String get notConnected => 'НЕ ПОДКЛЮЧЕНО';

  @override
  String get download => 'СКАЧАТЬ';

  @override
  String get upload => 'ЗАГРУЗИТЬ';

  @override
  String get connectNow => 'ПОДКЛЮЧИТЬСЯ';

  @override
  String get disconnectUpper => 'ОТКЛЮЧИТЬ';

  @override
  String get daysRemaining => 'осталось дней';

  @override
  String get selectLocation => 'Выбор локации';

  @override
  String serversCount(num count) {
    String _temp0 = intl.Intl.pluralLogic(
      count,
      locale: localeName,
      other: '$count серверов',
      few: '$count сервера',
      one: '1 сервер',
      zero: 'Нет серверов',
    );
    return '$_temp0';
  }

  @override
  String get autoSelect => 'Авто выбор';

  @override
  String get optimalServer => 'Оптимальный сервер по скорости';

  @override
  String get serversNotFound => 'Серверы не найдены';

  @override
  String get refresh => 'Обновить';

  @override
  String get serverNotSelected => 'Сервер не выбран';

  @override
  String get failedToLoadServers => 'Не удалось загрузить серверы';

  @override
  String get settings => 'Настройки';

  @override
  String get supportTelegram => 'Поддержка Telegram Чат';

  @override
  String get privacyPolicy => 'Политика конфиденциальности';

  @override
  String get version => 'Версия';

  @override
  String get rateUs => 'Оцените нас';

  @override
  String get privacyPolicyContent =>
      'Политика конфиденциальности Vless VPN\nПоследнее обновление: 22 февраля 2026 года\n\nДобро пожаловать в Vless VPN. Мы уважаем и защищаем вашу конфиденциальность. Настоящая Политика конфиденциальности объясняет, как мы собираем, используем и защищаем вашу информацию при использовании нашего мобильного приложения и услуг.\n\nИспользуя Vless VPN, вы соглашаетесь с условиями настоящей Политики. Если вы не согласны с ними, пожалуйста, прекратите использование приложения.\n\n1. Введение и общие положения\nVless VPN — это приложение, предназначенное для обеспечения безопасного и анонимного доступа в интернет. Мы построили наш сервис на принципе минимального сбора данных. В отличие от многих других сервисов, мы не ведем логи вашей активности в интернете.\n\nНаша Политика конфиденциальности распространяется на все данные, которые могут быть получены в процессе использования приложения Vless VPN.\n\n2. Какую информацию мы собираем (и не собираем)\nМы разработали Vless VPN таким образом, чтобы он не собирал информацию о ваших действиях в сети. Мы придерживаемся политики \"No Logs\".\n\n2.1. Мы НЕ собираем:\nИсторию просмотров: Мы не отслеживаем, какие сайты вы посещаете.\nСодержимое трафика: Мы не читаем и не записываем содержимое ваших данных.\nDNS-запросы: Ваши запросы к системе доменных имен обрабатываются анонимно (с использованием технологий типа FakeDNS) и не логируются.\nТочные данные о местоположении: Мы не отслеживаем ваше GPS-местоположение.\n\n2.2. Ограниченная техническая информация:\nДля обеспечения работоспособности сервиса, улучшения качества связи и соблюдения требований магазинов приложений (Google Play), мы можем получать определенную минимальную техническую информацию, которая не позволяет идентифицировать личность пользователя:\nИнформация об устройстве: Модель устройства, версия операционной системы (Android), версия приложения. Это нужно для корректной работы и отправки уведомлений об обновлениях.\nИнформация о сети: Основная информация о типе подключения (Wi-Fi, мобильная сеть) для оптимизации скорости соединения. Ваш реальный IP-адрес обрабатывается только в момент соединения для установки туннеля и не хранится на наших серверах.\n\n3. Требуемые разрешения приложения\nДля функционирования VPN Vless необходимо запросить у вашего устройства определенные разрешения:\nINTERNET (Полный доступ к сети): Требуется для установления VPN-соединения и передачи данных через наши серверы.\nACCESS_NETWORK_STATE (Просмотр подключений к сети): Нужно для проверки состояния вашего подключения (например, чтобы переподключить VPN при смене сети или предупредить вас об отсутствии интернета).\nFOREGROUND_SERVICE (Работа в фоновом режиме): Необходимо для поддержания стабильного и постоянного VPN-соединения, даже когда приложение свернуто.\nWAKE_LOCK (Предотвращение перехода в спящий режим): Используется для предотвращения отключения VPN сервисом Android при длительном простое устройства.\nPOST_NOTIFICATIONS (Отправка уведомлений): Для отображения информации о состоянии VPN-соединения в строке состояния.\n\nМы не запрашиваем разрешения на доступ к вашему списку контактов, календарю, микрофону или файлам, так как они не нужны для работы сервиса.\n\n4. Рекламные сети и трекеры (Транспарентность)\nВ текущей версии приложения Vless VPN может использоваться код рекламных сетей для показа рекламы, позволяющей нам поддерживать бесплатные серверы. При статическом анализе кода приложения были обнаружены сигнатуры трекеров, относящихся к категории \"advertisement\" (реклама).\nЭто означает, что рекламные модули могут собирать обезличенные данные для показа таргетированной рекламы, такие как:\nРекламный идентификатор устройства (Ad ID);\nИнформация о том, как вы взаимодействуете с рекламой (клики, просмотры).\nЭти данные собираются рекламными партнерами (третьими лицами) согласно их собственным политикам конфиденциальности и не связаны с вашей активностью в VPN-туннеле. Вы можете сбросить рекламный идентификатор или отключить персонализацию рекламы в настройках вашего Android-устройства.\n\n5. Передача данных третьим лицам\nМы не продаем и не передаем ваши личные данные третьим лицам в целях, не связанных с работой приложения.\nКак указано в разделе 4, данные могут обрабатываться рекламными партнерами. На странице приложения в Google Play указано, что \"разработчик заявляет, что приложение не передает данные пользователей другим компаниям\". Это относится к пользовательским данным, генерируемым внутри VPN-туннеля (ваш трафик), и не противоречит наличию стандартных рекламных SDK, которые работают вне туннеля и собирают данные об установках и взаимодействии с рекламой.\n\n6. Безопасность данных\nМы принимаем разумные меры для защиты вашей информации. Соединение с нашими серверами защищено современными криптографическими протоколами.\nВажное примечание о шифровании: Как и многие другие VPN-приложения, Vless VPN перенаправляет ваш трафик через зашифрованный туннель. Однако согласно информации на странице приложения в Google Play, передаваемые данные не проходят дополнительное сквозное шифрование поверх туннеля, если вы посещаете сайты без HTTPS (однако подавляющее большинство современных сайтов используют HTTPS, что обеспечивает шифрование на уровне приложения).\n\n7. Хранение данных и их удаление\nХранение: Мы не храним данные, которые вы передаете через VPN. Кратковременные технические логи (например, пиковая нагрузка на сервер) обезличены и удаляются в течение нескольких часов.\nУдаление: Так как мы не собираем ваши персональные данные (не требуем регистрации по email и т.д.), у нас физически отсутствует база данных с информацией о вас, которую можно было бы удалить по запросу. Разработчик не предоставляет механизма удаления данных, так как данные не собираются.\n\n8. Дети\nНаш сервис не предназначен для лиц младше 13 лет. Мы не собираем намеренно личную информацию от детей.\n\n9. Изменения в Политике конфиденциальности\nМы можем обновлять нашу Политику конфиденциальности время от времени. Мы уведомим вас об изменениях, разместив новую версию на этой странице и обновив дату \"Последнего обновления\".\n\n10. Связь с нами\nЕсли у вас есть вопросы относительно настоящей Политики конфиденциальности или обработки ваших данных, пожалуйста, свяжитесь с нами по электронной почте: admingwvpn@proton.me';
}
